from random import choice, randint

part1 = ["Дорбый", "Новый", "Кот", "Я - ", "Ты - ", "Начиная", "Год", "Абоаба..", "Дорогой", "Верить", "Санта", "А", "Пабло", "Прекрасный", "Смертоносный", "Если", "Идёт", "Дед"]
part2 = ["год", "Мороз", "конь", "патриот", "люблю", "обиды", "барашек", "праздник", "памятник", "событие", "великолепно", "хочет", "побеждает", "счастье", "отлично", "класс", "навсегда"]
part3 = ["к нам", "не подведёт", "да!", "никогда", "хочет", "найс", "не найс", "навсегда", "", "йоу!", "ура"]
part4 = ["идёт", "навсегда", "ура", "кончается", "завуда", "зануда", "добряк", "чудный", "абобус"]

santa = ["Барбара", "Клаус", "Пабло"]
cat = ["Зануда", "Учёный", "- Весельчак", "Идиот", "Дурдом", "Тугодум", "Бульдог"]

end = ["!!", "!!!", "!", "?!", "?", "!?", "...", ".", "??", "???", "??!!", "!?!?", "!!??", "!!!???", "???!!!", "!?!?!?", "!!!1!!!!!1!!11!!!1!!!!!!!1!!11!1!!!1!!!!1!!!1!!!!!!1!!!!!!!1!!1!!1!!11!11!!1!", ")", "))", "))))))00))0))", "(", "((", "(((((9(9(((99(((("]

def generate_text():
    p1 = choice(part1)
    p2 = choice(part2)
    p3 = choice(part3)
    p4 = choice(part4)
    p5 = ""
    p6 = " "
    if p1 == "Санта":
        p5 = choice(santa)
    if p1 == "Кот":
        p5 = choice(cat)
    return f"{p1} {p5} {p2} {p3} {p4} {p6} {choice(end)}"

